Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisPartAreaAttributes Property
 The analysis part area attributes.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartAreaAttributes AnalysisPartAreaAttributes { get; set; }
Public Property AnalysisPartAreaAttributes As AnalysisPartAreaAttributes
	Get
	Set
Property Value
Type: AnalysisPartAreaAttributes
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace